# Q1. List any five functions of the pandas library with execution.

In [5]:
#the five functions of the pandas library are as follows

#first one is - read_csv() 
import pandas as pd
df=pd.read_csv('C:\\Users\\161sh\\Desktop\\employees.csv')


# second function is 
df.dropna(axis=1)


# third function is 
df.loc[0]

# fourth function is 
df.head(3)

# fivth function is 
df.tail(3)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
47,138,Stephen,Stiles,SSTILES,650.121.2034,26-OCT-05,ST_CLERK,3200,-,123,50
48,139,John,Seo,JSEO,650.121.2019,12-FEB-06,ST_CLERK,2700,-,123,50
49,140,Joshua,Patel,JPATEL,650.121.1834,06-APR-06,ST_CLERK,2500,-,123,50

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
import numpy as np 

#creating a dataframe and naming the custom columns 
df1=pd.DataFrame(np.zeros((3,3),int) , columns=['A','B','C'])

#setting another index to it 

newIndex=pd.Index(range(0,2*len(df1),2))
df1.set_index(newIndex,inplace=True)

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. Thefunction should print the sum to the console.

In [86]:
df2=pd.read_csv('C:\\Users\\161sh\\Desktop\\q3 question.csv')
# DataFrame is created and we need to apply the sum operation

print(df2.head(3))

# value variable holds the sum of first 3 rows 
value=df2['amount'][:3].sum()
print(f"The sum of first threr rows is {value}")

    names  amount
0  alice      100
1    bob      200
2   maddy     300
The sum of first threr rows is 600

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column'Word_Count' that contains the number of words in each row of the 'Text' column.

print("yes)

In [144]:
import pandas as pd
p=pd.DataFrame([[100,"afroze",1],[200,"afr",2],[300,"shaa",3]],columns=['a','b','c'])

def coutner(a):
    return len(a)
p['len of names ']=p['b'].apply(coutner)

     a       b  c
0  100  afroze  1
1  200     afr  2
2  300    shaa  3

##  Q5. How are DataFrame.size() and DataFrame.shape() different?

size gives the number of elements present in the data frame
while shape gives the structure of the data frame

## Q6. Which function of pandas do we use to read an excel file?

 pandas.read_excel()

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains emailaddresses in the format 'username@domain.com'. Write a Python function that creates a new column'Username' in df that contains only the username part of each email address.

In [162]:
df=pd.DataFrame([['161shaa@gmail.com'],['pqr@gmail.com'],['abc@gmail.com']],columns=['gmail'])
print("-----------before-----------")
print(df)
def extract(x):
    value=x.index("@")
    return x[0:value]
df['names']=df['gmail'].apply(extract)
print("-----------after-----------")
print(df)

-----------before-----------
               gmail
0  161shaa@gmail.com
1      pqr@gmail.com
2      abc@gmail.com
-----------after-----------
               gmail    names
0  161shaa@gmail.com  161shaa
1      pqr@gmail.com      pqr
2      abc@gmail.com      abc

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selectsall rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. Thefunction should return a new DataFrame that contains only the selected rows.

In [16]:

import pandas as pd
df=pd.DataFrame(

    [
[0 , 3 ,  5 ,  1],

[1  ,8   ,2   ,7],

[2  ,6  , 9 ,  4],

[3 , 2 ,  3   ,5],

[4  ,9  , 1   ,2]

    ] ,columns=['a','b','c','d'])

df[(df['b']>5 )& (df['c']<10)]

   a  b  c  d
1  1  8  2  7
2  2  6  9  4
4  4  9  1  2

   a  b  c  d
1  1  8  2  7
2  2  6  9  4
4  4  9  1  2